app/Models/Usuario.php

    public function getOneUsuario($nick){
        $builder= $this->db->table('usuario');
        $builder->select('usuario.* , r.tipo_rol as rol, concat(pn.nombre, " ", pn.apellido) as persona');
        $builder->join('roles r', 'usuario.id_roles = r.id_roles', 'inner');
        $builder->join('persona p', 'usuario.id_persona = p.id_persona', 'inner');
        $builder->join('per_natural pn', 'p.id_persona = pn.id_persona', 'inner');
        $builder->where('usuario.nick', $nick);
        $query= $builder->get();
---
SELECT `usuario`.*, `r`.`tipo_rol` as `rol`, concat(pn.nombre, " ", pn.apellido) as persona
FROM `usuario`
INNER JOIN `roles` `r` ON `usuario`.`id_roles` = `r`.`id_roles`
INNER JOIN `persona` `p` ON `usuario`.`id_persona` = `p`.`id_persona`
INNER JOIN `per_natural` `pn` ON `p`.`id_persona` = `pn`.`id_persona`
WHERE `usuario`.`nick` = 'Iverson25'